lytruongsinh123/STM32F407VGT6/Sources/002led_button.c
#include "stm32f407xx.h"
#include "stm32f407xx_gpio_driver.h"
#define HIGH        ENABLE
#define BTN_PRESSED HIGH
void delay(void)
{
    for (uint32_t i = 0; i < 500000 / 2; i++)
        ;
}
int main(void)
{
    GPIO_Handle_t gpioled, gpiobtn;
    gpioled.pGPIOx                             = GPIOD;
    gpioled.GPIO_PinConfig.GPIO_PinNumber      = GPIO_PIN_NO_12;
    gpioled.GPIO_PinConfig.GPIO_PinMode        = GPIO_MODE_OUT;
    gpioled.GPIO_PinConfig.GPIO_PinSpeed       = GPIO_SPEED_FAST;
    gpioled.GPIO_PinConfig.GPIO_PinOType       = GPIO_OP_TYPE_PP;
    gpioled.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    GPIO_PCLKControl(GPIOD, ENABLE);
    GPIO_Init(&gpioled);

    gpiobtn.pGPIOx                             = GPIOA;
    gpiobtn.GPIO_PinConfig.GPIO_PinNumber      = GPIO_PIN_NO_0;
    gpiobtn.GPIO_PinConfig.GPIO_PinMode        = GPIO_MODE_IN;
    gpiobtn.GPIO_PinConfig.GPIO_PinSpeed       = GPIO_SPEED_FAST;
    gpiobtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    GPIO_PCLKControl(GPIOA, ENABLE);
    GPIO_Init(&gpiobtn);
    while (1)
    {
        if (GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0) == BTN_PRESSED)
        {
            delay();
            GPIO_ToggleOutputPin(GPIOD, GPIO_PIN_NO_12);
        }
    }
    return 0;
}